type IQuestion = {
	question: string;
	choices: string[];
};

const questions: IQuestion[] = [
	{
		question: '1. เวลาคุยกับใครคุณทำท่าอย่างไร ?',
		choices: [
			'ยืนกอดอก',
			'ยืนกุมมือ',
			'เท้าสะเอว 1 ข้างหรือทั้ง 2',
			'แตะหรือผลักคนที่คุยด้วย',
		],
	},
	{
		question: '2. ท่านั่งสบายๆ ของคุณ เป็นยังไง',
		choices: [
			'เอาขาพับเอียงไปข้างใดข้างหนึ่ง หรือนั่งพับเพียบ',
			'นั่งไขว่ห้าง',
			'ยืดขาตรง',
			'นั่งทับขาข้างใดข้างหนึ่ง',
		],
	},
	{
		question:
			'3. เมื่อมีอะไรที่ทำให้คุณรู้สึกถูกใจหรือขำมาก คุณแสดงออกอย่างไร',
		choices: [
			'หัวเราะดังๆ อย่างพอใจ',
			'หัวเราะแต่ไม่ดังมาก',
			'หัวเราะแบบไม่มีเสียง',
			'ยิ้มแบบอายๆ',
		],
	},
	{
		question: '4. ชอบสีอะไรมากที่สุดต่อไปนี้',
		choices: [
			'สีแดง หรือ สีส้ม',
			'สีดำ',
			'สีนํ้าตาล หรือ สีเทา',
			'สีเขียว',
		],
	},
	{
		question: '5. คุณชอบรูปทรงใดมากที่สุด',
		choices: ['ทรงกลม', 'สี่เหลี่ยมจตุรัส', 'สามเหลี่ยม', 'วงรี'],
	},
];

export { questions };
